{
  "chunks": [
    {
      "id": "about_nylago_core_capabilities",
      "source_id": "nylago_core_features",
      "type": "about", 
      "lang": "bilingual",
      "title": "NYLAGo Cryptocurrency Command Generator",
      "section": "core_capabilities",
      "tags": ["capabilities", "features", "command generator", "transfers", "swaps", "QR codes", "X.com integration"],
      "as_of": "2025-01-15",
      "stability": "stable",
      "source_url": "internal://about/core-features",
      "hash": "abt_core_001",
      "body": "NYLAGo helps simplify cryptocurrency operations through command generation and social media integration: 1) Transfer Command Generation - Creates properly formatted transfer commands for posting on X.com across Solana, Ethereum, and Algorand networks. 2) Swap Command Creation - Generates swap commands for trading tokens within the same blockchain network only (no cross-chain). 3) QR Code Generation - Creates payment QR codes for receiving cryptocurrency on any supported network. 4) Username-Based Transfers - Enables transfers using X.com usernames instead of complex wallet addresses. 5) Social Media Integration - Formats commands for X.com posting where NYLA executes the transactions. 6) Community Features - Provides raid lists and social engagement tools separate from blockchain operations.",
      "summary_en": "NYLAGo simplifies cryptocurrency operations through command generation for transfers, swaps, QR payments, and X.com integration across Solana, Ethereum, and Algorand networks.",
      "summary_zh": "NYLAGo通过命令生成简化加密货币操作，支持转账、交换、QR支付和跨Solana、Ethereum、Algorand网络的X.com集成。",
      "priority": 10,
      "related_chunks": ["about_nylago_overview", "faq_what_can_nyla_do", "about_nylago_what_can_do"],
      "glossary_terms": ["command generation", "transfers", "swaps", "QR codes", "X.com", "social integration"]
    },
    {
      "id": "about_nylago_what_else_can_do", 
      "source_id": "nylago_additional_capabilities",
      "type": "about",
      "lang": "bilingual", 
      "title": "What else can NYLAGo do?",
      "section": "additional_capabilities",
      "tags": ["what else", "additional", "capabilities", "features", "more", "other", "also"],
      "as_of": "2025-01-15",
      "stability": "stable",
      "source_url": "internal://about/additional-capabilities", 
      "hash": "abt_additional_001",
      "body": "Beyond basic transfers, NYLAGo offers additional helpful features: 1) Username-Based Transfers - Send tokens using X.com usernames instead of long wallet addresses across all supported networks. 2) QR Code Payment Requests - Generate QR codes for receiving payments on Solana, Ethereum, or Algorand networks. 3) Same-Network Token Swaps - Create swap commands for trading tokens within the same blockchain (Solana-to-Solana, Ethereum-to-Ethereum, Algorand-to-Algorand only). 4) X.com Integration - All transactions happen through posting generated commands on X.com where NYLA executes them. 5) Community Engagement Tools - Access raid lists and social features for community interaction separate from blockchain operations. 6) Multi-Network Support - Works with three major blockchain networks while maintaining simplicity.",
      "summary_en": "NYLAGo provides username-based transfers, QR payment requests, same-network swaps, X.com integration, and community tools beyond basic cryptocurrency operations.",
      "summary_zh": "除了基本的加密货币操作，NYLAGo还提供基于用户名的转账、QR支付请求、同网络交换、X.com集成和社区工具。",
      "priority": 10,
      "related_chunks": ["about_nylago_core_capabilities", "faq_what_can_nyla_do", "about_nylago_overview"],
      "glossary_terms": ["username transfers", "QR codes", "same-network swaps", "X.com integration", "community tools"]
    },
    {
      "id": "about_nylago_key_benefits",
      "source_id": "nylago_key_benefits", 
      "type": "about",
      "lang": "bilingual",
      "title": "NYLAGo's Key Benefits",
      "section": "key_benefits",
      "tags": ["benefits", "advantages", "simple", "easy", "social", "convenient"],
      "as_of": "2025-01-15", 
      "stability": "stable",
      "source_url": "internal://about/key-benefits",
      "hash": "abt_benefits_001",
      "body": "NYLAGo provides key benefits for cryptocurrency users: 1) Simplified Transfers - No need to copy/paste long wallet addresses, just use X.com usernames. 2) Social Media Convenience - Execute transactions through familiar X.com platform instead of complex wallet interfaces. 3) Multi-Network Support - Access Solana, Ethereum, and Algorand networks through one simple interface. 4) Mobile-Friendly QR Codes - Generate payment QR codes that work with mobile wallets. 5) Community Integration - Access raid lists and social engagement features alongside cryptocurrency operations. 6) No Wallet Downloads - Execute transactions through X.com posts without installing additional wallet software.",
      "summary_en": "NYLAGo offers simplified transfers via usernames, social media convenience, multi-network support, mobile QR codes, and community integration.",
      "summary_zh": "NYLAGo提供通过用户名简化转账、社交媒体便利性、多网络支持、移动QR码和社区集成。",
      "priority": 9,
      "related_chunks": ["about_nylago_core_capabilities", "about_nylago_what_else_can_do"], 
      "glossary_terms": ["simplified", "usernames", "social media", "multi-network", "mobile-friendly", "community"]
    }
  ]
}