{
  "chunks": [
    {
      "id": "about_nylago_overview",
      "source_id": "nylago_core_capabilities", 
      "type": "about",
      "lang": "bilingual",
      "title": "What is NYLAGo? Core Capabilities",
      "section": "overview",
      "tags": ["about", "capabilities", "overview", "features", "X.com", "commands"],
      "as_of": "2025-01-15",
      "stability": "stable",
      "source_url": "internal://about/overview",
      "hash": "abt_overview_001",
      "body": "NYLA is a web3 service that facilitates blockchain transactions through social platform integration. It leverages X.com to execute cryptocurrency operations behind the scenes. NYLAGo is the interface tool that helps users interact with NYLA. Core capabilities: 1) Generate transfer commands for sending tokens within Solana, Ethereum, or Algorand networks (no cross-chain transfers). 2) Create swap commands for trading tokens within the same blockchain network only. 3) Generate QR codes for receiving payments on each supported blockchain. 4) Execute transactions through X.com posts/replies when users post generated commands. 5) Facilitate community engagement through social features separate from blockchain operations. NYLA can be called directly through X.com posts or replies to execute cryptocurrency operations.",
      "summary_en": "NYLA is a web3 service for blockchain transactions via social platforms. NYLAGo interface generates commands for X.com posting. Supports transfers and swaps within Solana, Ethereum, or Algorand networks (no cross-chain).",
      "summary_zh": "NYLA是通过社交平台进行区块链交易的web3服务。NYLAGo界面为X.com发布生成命令。支持Solana、Ethereum或Algorand网络内的转账和交换（无跨链）。",
      "priority": 10,
      "related_chunks": ["faq_how_to_send", "howto_transfers_send_guide", "faq_supported_blockchains"],
      "glossary_terms": ["NYLAGo", "AI agent", "X.com", "commands", "transfers", "swaps", "QR codes", "community"]
    },
    {
      "id": "about_nylago_what_can_do",
      "source_id": "nylago_feature_list",
      "type": "about", 
      "lang": "bilingual",
      "title": "What can NYLAGo do?",
      "section": "capabilities",
      "tags": ["features", "capabilities", "transfers", "swaps", "QR", "social"],
      "as_of": "2025-01-15",
      "stability": "stable",
      "source_url": "internal://about/capabilities",
      "hash": "abt_capabilities_001",
      "body": "NYLAGo can: 1) Generate transfer commands for sending tokens to usernames (no wallet addresses needed) within Solana, Ethereum, or Algorand networks. 2) Create swap commands for trading tokens within the same blockchain network (Solana-to-Solana, Ethereum-to-Ethereum, Algorand-to-Algorand only). 3) Generate QR codes for receiving payments on any supported blockchain. 4) Create X.com posts with transaction commands that execute when posted. 5) Provide community engagement tools like raid lists and social features. 6) Support multiple blockchain networks while maintaining simplicity through social media integration.",
      "summary_en": "NYLAGo generates commands for transfers, same-network swaps, QR payments, and X.com posting. Supports 3 blockchains with social integration and community features.",
      "summary_zh": "NYLAGo生成转账、同网络交换、QR支付和X.com发布的命令。支持3个区块链，具有社交集成和社区功能。",
      "priority": 10,
      "related_chunks": ["about_nylago_overview", "faq_how_to_send", "faq_supported_blockchains"],
      "glossary_terms": ["capabilities", "transfers", "swaps", "same-network", "QR codes", "X.com posting", "community tools"]
    }
  ]
}